**Landing zones configuration used**

```
app_services = {
  web1 = {
    resource_group_key   = "asp_re1"
    name                 = "nga-d-weu-hrx-app-01"
    app_service_plan_key = "asp1"

    settings = {
      lz_key      = "networking_spoke"
      vnet_key    = "spoke"
      subnet_key  = "asp"

      enabled = true
    }
  }
}
```

**Expected result**

```
# module.solution.module.app_services["web1"].azurerm_app_service.app_service will be created
  + resource "azurerm_app_service" "app_service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)

[...]

  # module.solution.module.app_services["web1"].azurerm_app_service_virtual_network_swift_connection.vnet_config[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "vnet_config" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-spoke/providers/Microsoft.Network/virtualNetworks/vnet-spoke/subnets/snet-asp"
    }
```